Repository: omegat-fi/B333-MateCat
Catalog: MateCat PROJEKTI/tm/unapproved.tmx
Source language: en
Languages: fi

source: For example, imagine that we have to translate a file containing the following phrase from English to French:
fi: Kuvittele esimerkiksi, että meidän tarvitsisi kääntää suomesta ranskaksi tiedosto, joka sisältää seuraavan lauseen:

source: My house is red.
fi: Taloni on punainen.

source: {1>In order to translate the file containing this phrase, we created a project for translating from English to French and associated a <1}{2>private TM key <2}and an {3>EN>FR glossary<3}.
fi: {1>Kääntääksemme tämän lauseen sisältävän tiedoston, loimme sille projektin kieliparilla suomi-ranska ja lisäsimme siihen <1}{2> yksityisen KM-avaimen <2}ja {3>FI>FR sanaston <3}.

source: In the glossary, we have the following term and its translation:
fi: Sanastossa on seuraava termi ja sen käännös:

source: Source
fi: Lähde

source: Target
fi: Kohde

source: House
fi: Talo

source: 3 {1>It is not possible to download the translated segment for a specific project yet.<1}
fi: 3 {1>Vielä ei ole mahdollista ladata tietyn projektin käännettyä segmenttiä. <1}

source: {1>We plan to devel-op such functionality in one of our next releases.<1}
fi: {1>Aiomme lisätä toiminnon johonkin seuraavista julkaisuistamme. <1}

source: 4 {1>Terms are words or set of words of a particular kind of language or branch of study.<1}
fi: 4 {1>Termit ovat sanoja tai fraaseja, joita käytetään tietyssä diskurssissa tai tutkimusalalla.<1}

source: Release 1.4 | {1>{2>www.matecat.com <2}{3>| <3}<1}{4>info@matecat.com<4}
fi: Versio 1.4 | www.matecat.com | info@matecat.com

source: Page 22
fi: Sivu 22

source: Opening the phrase for translation, we have no suggestions from our translation memory but we have the translation of “house” in our glossary.
fi: Kun lause avataan käännettäväksi, käännösmuisti ei osaa ehdottaa käännöstä, mutta sanastosta löytyy käännös sanalle “talo”.

source: In this case, MateCat suggests how to translate the term “house”.
fi: Tässä tapauksessa MateCat ehdottaa, miten termin “talo” voisi kääntää.

source: In MateCat, {1>the glossary is included in the <1}{2>private TM key<2}{3> associated with the project.<3}
fi: MateCatissä {1>sanasto sisällytetään<1} {2>yksityiseen KM-avaimeen<2}{3>, joka on liittyy projektiin.<3}

source: {3>If no private TM key is associated yet, a new one will be created once you insert the first glossary term.<3}
fi: Mikäli yksityistä TM avainta ei ole vielä olemassa, uusi luodaan lisätessäsi sanaston ensimmäisen termin.

source: {1}{2>Note: please refer to the section <2}{3>How to Use Glossary Terms in Your Translated Segment<3}{4> to know how to add a glossary term while translating.<4}
fi: {1}{2>Huom: Viittaa osioon <2}{3>Miten käytän sanastotermejä käännetyssä segmentissäni<3}{4> oppiaksesi, miten voit lisätä sanastoon termin kääntäessäsi.<4}

source: {1>CSV <1}is the only supported glossary format.
fi: {1>CSV <1}on ainoa tuettu sanastomuoto.

source: You just have to upload it to your private TM key.{2>5<2}
fi: Sinun tulee ladata se yksityiseen KM-avaimeesi.{2>5<2}

source: {1}{2>Why add a glossary for your project?<2}
fi: {1}{2>Miksi lisäisin sanaston projektiini?<2}

source: {3>If you upload a glossary, MateCat also looks up single terms.<3}
fi: {3>Jos käytät sanastoa, MateCat etsii myös yksittäisiä termejä.<3}

source: {3>In the translation memory, this function is performed at <3}{4>segment level<4}{5>, whereas in the glossary it is performed at <5}{6>term level<6}{7>.<7}
fi: {3>Käännösmuistissa tämä toiminto toteutetaan <3}{4>segmentin tasolla<4}{5>, kun taas sanastossa se toteutetaan <5}{6>termin tasolla<6}{7>.<7}

source: Translation Editor User Interface
fi: Käännöseditorin käyttöliittymä

source: Documents are translated in the {1>Translation Editor <1}window.
fi: Dokumentteja käännetään {1>Käännöseditori<1}-ikkunassa.

source: This is the translator’s main interface.
fi: Tämä on kääntäjän tärkein käyttöliittymä.

source: You can access this page:
fi: Voit käyttää sivua:

source: {1>• <1}By clicking on the {2>Translate <2}button on the {3>Analysis page<3}
fi: {1>• <1}Klikkaamalla {2>Käännä<2}-nappia {3>Analyysi<3}-sivulla

source: • {1>directly from the corresponding previously generated/provided <1}{2>job URL<2}
fi: • {1>suoraan aiemmin luodusta/tarjotusta <1}{2>työn osoitteesta<2}

source: 5 {1>The user cannot upload the glossary by him/herself yet.<1}
fi: 5 {1>Käyttäjä ei voi vielä ladata palvelimelle itse sanastoa.<1}

source: {1>We plan to develop such functionality in one of our next releases.<1}
fi: {1>Aiomme lisätä toiminnon johonkin seuraavista julkaisuistamme. <1}

source: Page 23
fi: Sivu 23

source: The job URL contains information about the {1>job <1}you are translating.
fi: Työn osoite sisältää tietoa {1>työstä <1}, jota olet kääntämässä.

source: Below, you will find an explanation of the different elements of the URL.
fi: Alla löydät selityksen osoitteen eri osista.

source: {1>• <1}www.matecat.com – {2>Base URL <2}{3>for the MateCat proprietary version. <3}{4>• <4}/translate – This indicates that you are in the {5>translation editor page<5}{6>. <6}{7>• <7}/Test – The {8>name <8}of the project you are translating.
fi: {1>• <1}www.matecat.com – {2>Lähtöosoite<2}{3>MateCatin yritysversiolle. <3}{4>• <4}/translate – Tämä viittaa, että olet {5>käännöseditorisivulla<5}{6>. <6}{7>• <7}/Test – Kääntämäsi projektin {8>nimi<8}.

source: {1>• <1}{2>/43505-0d5d8d53c774 – The <2}{3>job ID <3}(43505) followed by the unique {4>job “password” <4}(in this case, 0d5d8d53c774).
fi: {1>• <1}{2>/43505-0d5d8d53c774 – <2}{3>Työn tunnus<3}(43505), jota seuraa uniikki {4>työn “salasana” <4}(tässä tapauksessa 0d5d8d53c774).

source: {1>• <1}#21694626 – The {2>unique identifier of the segment <2}you are translating.
fi: {1>• <1}#21694626 – Kääntämäsi segmentin {2>uniikki tunniste<2}.

source: This number changes every time you open a new segment.
fi: Tämä numero muuttuu aina kun avaat uuden segmentin.

source: The {1>Translation Editor User Interface <1}contains only one environment with all the information necessary for the translator to work on the job.
fi: {1>Käännöseditorin käyttöliittymä<1} sisältää vain yhden ympäristön, jossa on kaikki tarvittava tieto, jota kääntäjä tarvitsee työskennelläkseen.

source: The interface contains the following bars and information:
fi: Käyttöliittymä sisältää seuraavat palkit ja tiedot:

source: o {1>Top bar<1}
fi: o {1>Yläpalkki<1}

source: {1}{2>Click on the logo to go to the <2}{3>homepage <3}{4>of the MateCat tool and create a new project.<4}
fi: {1}{2>Klikkaa logoa siirtyäksesi MateCatin <2}{3>kotisivulle <3}{4> ja luodaksesi uuden projektin.<4}

source: Page 24
fi: Sivu 24

source: {6>Click on the arrow to see the list of the files and <6}{7>navigate through them<7}{8>.<8}
fi: {6>Klikkaa nuolta nähdäksesi listan tiedostoista ja <6}{7>selataksesi niitä<7}{8>.<8}

source: {4>The preview contains your translation and machine translation for the remaining untranslated segments.<4}
fi: {4>Esikatselu sisältää käännöksesi ja konekäännöksen niille segmenteille, joita ei ole vielä käännetty.<4}

source: {6>Click on the icon to go to the segment with the error and fix it.<6}
fi: {6>Klikkaa ikonia siirtyäksesi virheen sisältävään segmenttiin ja korjataksesi sen.<6}

source: Page 25
fi: Sivu 25

source: {5>If necessary, you can replace the term you searched for with another one.<5}
fi: {5>Voit tarvittaessa korvata etsimäsi termin jollain toisella.<5}

source: o {1>Editor window<1}
fi: o {1>Editori-ikkuna<1}

source: {3>Click or use the shortcut ALT+CTRL+i to copy the source text to the target box<3}
fi: {3>Klikkaa tai käytä näppäinoikotietä ALT+CTRL+i kopioidaksesi lähtötekstin kohdekenttään<3}

source: {1}{2>Translated and go to next untranslated <2}{3>button.<3}
fi: {1}{2>Hyväksy käännös ja mene seuraavaan kääntämättömään<2}{3>-nappi.<3}

source: {3>Click<3}{j}{3>or<3}{j}{3>use<3}{j}{3>the<3}{j}{3>shortcut CTRL+SHIFT+Enter to <3}{4>confirm your translation of the current segment and to move to the next untranslated segment<4}{5>.<5}
fi: {3>Klikkaa <3}{j}{3>tai <3}{j}{3>käytä <3}{j}{3><3}{j}{3>näppäinoikotietä CTRL+SHIFT+Enter <3}{4>hyväksyäksesi aktiivisen segmentin käännöksen ja siirtyäksesi seuraavaan kääntämättömään segmenttiin<4}{5>.<5}

source: {3>Click or use the shortcut CTRL+Enter to <3}{4>confirm your translation and save it in the translation memory<4}
fi: {3>Klikkaa tai käytä näppäinoikotietä CTRL+Enter <3}{4>hyväksyäksesi käännöksen ja tallentaaksesi sen käännösmuistiin<4}

source: {3>This tab shows the user the <3}{4>TM matches and/or MT suggestions <4}{5>for the current segment.<5}
fi: {3>Tässä välilehdessä näkyvät <3}{4>käännösmuistista löytyneet vastaavuudet ja/tai konekääntimen ehdotukset <4}{5>aktiiviselle segmentille.<5}

source: {3>Open this tab or use the shortcut ALT+c to <3}{4>search the translation memory, <4}{5>both public and private, if any, for a particular word, word sequence or phrase<5}
fi: {3>Avaa tämä välilehti tai käytä näppäinoikotietä ALT+c <3}{4>hakeaksesi käännösmuistista, <4}{5>sekä julkisesta että yksityisestä, mikäli saatavilla, tiettyä sanaa, sanaketjua tai fraasia<5}

source: {3>Open this tab to <3}{4>check suggestions<4}{j}{4>from<4}{j}{4>a<4}{j}{4>previous<4}{j}{4>glossary <4}{5>included in the private TM key which is associated with the project or to <5}{6>add new terms to the glossary<6}{7>.<7}
fi: {3>Avaa tämä välilehti <3}{4>katsoaksesi ehdotuksia <4}{j}{4><4}{j}{4><4}{j}{4>aiemmasta<4}{j}{4>sanastosta<4}{5>, joka sisältyy yksityiseen KM-avaimeen, joka on yhteydessä projektiin tai <5}{6>lisätäksesi uusia termejä sanastoon<6}{7>.<7}

source: {4>glossary <4}{5>included in the private TM key which is associated with the project or to <5}{6>add new terms to the glossary<6}{7>.<7}
fi: sanastosta<4}{5>, joka sisältyy yksityiseen KM-avaimeen, joka on yhteydessä projektiin tai <5}{6>lisätäksesi uusia termejä sanastoon<6}{7>.<7}

source: Page 27
fi: Sivu 27

source: {1}{2>Click to <2}{3>add your personal TM <3}{4>to the ongoing translation.<4}
fi: {1}{2>Klikkaa <2}{3>lisätäksesi henkilökohtainen KM <3}{4>avoinna olevalle käännökselle. <4}

source: o {1>Bottom bar<1}
fi: o {1>Alapalkki<1}

source: {4>Clicking on <4}{5>Payable Words <5}{6>button will take you to the <6}{7>Volume Analysis page<7}{8> of the project.<8}
fi: {4>Klikkaamalla <4}{5>Payable Words (maksettavat sanat) <5}{6>-painiketta pääset <6}{8>projektin <8}{7>Volume Analysis (Volyymianalyysi) -sivulle. <7}

source: {1}{2>Number of words left <2}{3>to translate for the entire job.<3}
fi: {3>Koko työn kääntämättömien sanojen <3}{1}{2>lukumäärä.<2}

source: Page 28
fi: Sivu 28

source: {1}{2>The <2}{3>estimated speed of your translating<3}{4>.<4}
fi: {1}{2><2}{3>Kääntämisesi arvioitu nopeus<3}{4>.<4}

source: {4>Based on the average time spent on the last 10 translated segments, MateCat calculates <4}{5>the hourly turnaround <5}{6>for the job if you are currently working on the translation.<6}
fi: {4>MateCat laskee 10 viimeksi käännettyyn segmenttiin käytetyn ajan perusteella <4}{5>tuntituoton <5}{6>työlle jos olet juuri työskentelemässä käännöksen kanssa.<6}

source: {6>After one hour of inactivity, this information is no longer available.<6}
fi: {6>Jos MateCatia ei käytä tuntiin, tämä tieto ei ole enää saatavilla.<6}

source: {1}{2>The <2}{3>estimated time left to complete <3}{4>the translation.<4}
fi: {1}{2><2}{4>Käännöksen <4}{3>valmistumiseen arvioitu jäljellä oleva aika.<3}

source: {4>Based on the time spent on the last 10 translated segments, MateCat calculates <4}{5>how much time is needed to complete the translation <5}{6>if you are currently working on the translation.<6}
fi: {4>MateCat laskee 10 viimeksi käännettyyn segmenttiin käytetyn ajan perusteella <4}{5>käännöksen valmistumiseen tarvittavan ajan <5}{6>työlle jos olet juuri työskentelemässä käännöksen kanssa.<6}

source: {1}{2>Link to access the <2}{3>Editing Log<3}{4> page<4}{5>, a <5}{6>statistical page<6}{j}{7>about<7}{j}{7>the<7}{j}{7>current<7}{j}{7>project.<7}{j}{7>(e.g. percentage of MT matches, percentage of TM matches, average post-editing efforts, etc.)<7}
fi: {1}{2>Linkki <2}{3>Editing Log <3}{4>-sivulle <4}{5>, joka on <5}{6>tilastosivu<6} {j}{7>sen <7}{j}{7>hetkisen <7}{j}{7>projektin <7}{j}{7>tilasta. <7}{j}{7>(esimerkiksi konekäännöksen osumien prosenttimäärä, käännösmuistin osumien prosenttimäärä, keskimääräinen post-editoinnin työmäärä, ja niin edelleen)<7}

source: Page 29
fi: Sivu 29

source: {1}Link to access the manual
fi: {1}Linkki käyttöohjeisiin

source: {1}{2>Information about the <2}{3>account you are logged in with<3}{4>.<4}
fi: {1}{2>Tietoa <2}{3>tilistä, jolla olet kirjautunut sisään<3}{4>.<4}

source: {4>Click on login to sign in using Google.<4}
fi: {4>Klikkaa kirjautuaksesi sisään Googlen avulla.<4}

source: Source text and target text are displayed {1>side by side<1}.
fi: Lähdeteksti ja kohdeteksti on esitetty {1>vierekkäin<1}.

source: Click on any segment in the target column to open it for translation.
fi: Klikkaa mitä tahansa segmenttiä kohdesarakkeessa avataksesi sen kääntämistä varten.

source: {1}{2>What if I need to stop translating and switch off my computer?<2}
fi: {1}{2>Mitä jos minun tarvitsee lopettaa kääntäminen ja sulkea tietokoneeni?<2}

source: {3>In MateCat your translation is <3}{4>automatically saved <4}{5>in the document when you edit the segment, and in the translation memory, if any, when you click on the <5}{6>Translated <6}{7>or <7}{8>T+>> <8}{9>buttons.<9}
fi: {3>MateCatissa käännöksesi <3}{4>tallennetaan automaattisesti <4}{5>asiakirjaan, kun editoit segmenttiä, ja käännösmuistiin, jos sellainen on, kun klikkaat <5}{6>Translated (Käännetty)- <6}{7>tai <7}{8>T+>> <8}{9>-painikkeita.<9}

source: {9>If you need to stop translating and switch off your computer, all you need to do is <9}{10>open the <10}{11>job URL <11}{12>again <12}{13>in your browser.<13}
fi: {9>Jos sinun tarvitsee lopettaa kääntäminen ja sammuttaa tietokone, sinun tarvitsee vain <9}{10>avata <10}{11>työn URL-osoite <11}{12>uudestaan <12}{13>selaimessasi.<13}

source: {13>MateCat automatically opens the last segment you edited.<13}
fi: {13>MateCat automaattisesti avaa segmentin, jota viimeksi muokkasit.<13}

source: {13>If you created the project yourself, by logging in with your <13}{14>Google account, <14}{15>you can recover the job URL from your <15}{16>Management Panel<16}{17>.<17}
fi: {13>Jos loit projektin itse kirjautumalla sisään <13}{14>Google tilisi <14}{15>avulla, voit palauttaa työn URL-osoitteen <15}{16>Hallintapaneelista<16}{17>.<17}

source: {17>If you were not logged in during the creation of the project or if you did not create the project by your-self, remember to store the job URL in a safe place in order to recover it again easily.<17}
fi: {17>Jos et ollut kirjautunut sisään projektia luodessasi tai et luonut projektia itse, muista säilyttää työn URL-osoite turvallisessa paikassa, jotta voit palauttaa työn helposti uudelleen.<17}

source: Page 30
fi: Sivu 30

source: Translation Toolbox
fi: Kääntämisen työkalulaatikko

source: Manage your language resources
fi: Hallitse kieliresurssejasi

source: You can store all your private TMs in MateCat and assign them to your projects when creating them or during translation.
fi: Voit säilyttää kaikki yksityiset käännösmuistisi MateCatissa ja määrittää niitä projekteille käännösmuistia luodessasi tai kääntämisen aikana.

source: When creating a project, click on “Options” and then on “Manage language resources”; a new window slides in from the right of your screen.
fi: Kun luot uutta projektia, klikkaa “Options” (asetukset)-kohtaa ja sen jälkeen “Manage language resources” (hallitse kieliresursseja)-kohtaa. Tällöin uuden ikkunan pitäisi liukua näkyviin ruudun oikeasta laidasta.

source: Click on “+ Add a TM” to open up the box to add your TM (see below).
fi: Klikkaa “+ Add a TM” (+ Lisää käännösmuisti) -kohtaa avataksesi ikkunan, jossa voit lisätä käännösmuistisi (katso alla).

source: You can do the same while translating: click on “Add your personal TM” and a new window slides in from the right of your screen.
fi: Voit tehdä saman kääntäessäsi: klikkaa “Add your personal TM” (Lisää henkilökohtainen käännösmuistisi) -kohtaa ja uuden ikkunan pitäisi liukua näkyviin ruudun oikeasta laidasta.

source: Click on “+ Add a TM” to add your private TM.
fi: Klikkaa “+Add a TM” (+ Lisää käännösmuisti) -kohtaa lisätäksesi yksityisen käännösmuistisi.

source: If you already have a private key (that is, an alphanumeric string that identifies your private TM), you can paste it in the first input box, otherwise click on “Create”.
fi: Jos sinulla on jo yksityinen avain (eli aakkosnumeerinen merkkijono, jonka avulla yksityisen käännösmuistisi yksilöidään), voit liittää sen ensimmäiseen syöttökenttään, muussa tapauksessa klikkaa “Create” (luo)-kohtaa.

source: Optionally, you can enter a short description to help you remember what the TM is for (e.g.{j}“ACME bird seeds”).
fi: Vaihtoehtoisesti voit syöttää lyhyen kuvauksen, joka auttaa sinua muistamaan, mitä varten käännösmuisti on (esimerkiksi {j}“ACMEn linnunsiemeniä”).

source: When you are done, click on “Confirm” and your private TM is created.
fi: Kun olet valmis, klikkaa “Confirm” (Vahvista)-kohtaa ja yksityinen käännösmuistisi on luotu.

source: Page 31
fi: Sivu 31

source: After you create a private TM as described above, you can import your TMX{1>6 <1}{2>files into it to re-use your previously translated content.<2}
fi: Kun olet luonut yksityisen käännösmuistin yllä kuvatulla tavalla, voit tuoda omat TMX{1>6 <1}{2>tiedostosi siihen jotta voit hyödyntää aikaisemmin käännettyä sisältöä.<2}

source: To import a TMX to your private TM, click on “Import TMX”, select the TMX file to import and confirm.
fi: Tuodaksesi TMX-tiedoston yksityiseen käännösmuistiin, klikkaa “Import TMX” (Tuo TMX-tiedosto) -kohtaa, ja valitse sitten tuotava TMX-tiedosto ja paina “Confirm”-kohtaa.

source: Note that a private TM on MateCat can contain any number of languages, so you can put all languages in a single private TM for a client, product, subject or whatever is more convenient for you.
fi: Huomaa, että yksityinen käännösmuisti voi MateCatissa sisältää minkä tahansa määrän kieliä, joten voit laittaa kaikki käytettävät kielesi yhteen yksityiseen käännösmuistiin asiakasta, tuotetta, aihetta tai mitä tahansa sinulle sopivaa asiaa varten.

source: In your Language resources panel you will see two separate lists:
fi: Omassa “Language resources” (Kieliresurssit) -paneelissasi näet kaksi erillistä listaa:

source: • {1>Active TMs are the translation memories that you have assigned to the project you are creating or to the project you are working on;<1}
fi: •{1>Aktiiviset käännösmuistit ovat ne käännösmuistit, jotka olet määrittänyt sille projektille, jota olet luomassa tai jonka kanssa parhaillaan työskentelet;<1}

source: • {1>Inactive TMs are the translation memories that you have saved in your profile on MateCat and that you can add to a project by selecting the “Lookup” checkbox and/or “Update”.<1}
fi: •{1>Passiiviset käännösmuistit ovat käännösmuisteja, jotka olet tallentanut MateCat-profiiliisi, ja jotka voit lisätä projektiin rastittamalla “Lookup” (Hae)-kohdan ja/tai “Update” (Päivitä)-kohdan.

source: You can activate a TM by selecting the Lookup or Update checkbox.
fi: Voit aktivoida käännösmuistin valitsemalla Lookup- tai Update-kohdan.

source: {7>Do not copy and paste them from the source text.<7}
fi: {7>Älä kopioi ja liitä niitä lähdetekstistä.<7}

source: o {1>Placeables and untranslatable text<1}
fi: o {1>Placeables (Asetettavat) ja kääntämättömissä olevat tekstit<1}

source: Currently, we cannot manage placeables and untranslatable parts.
fi: Tällä hetkellä emme voi käsitellä asetettavia ja kääntämättömiä osia.

source: We plan to develop such functionality in one of our next releases.
fi: Aiomme kehittää kyseisen toiminnon tuleviin versioihimme.

source: Page 41
fi: Sivu 41

source: Confirming a Segment
fi: Segmentin vahvistaminen

source: Once your translation has been entered or the pre-translated segment edited, click on the {1>Translated <1}{2>button to <2}{3>confirm your translation and move to the next segment<3}.
fi: Kun käännöksesi on lisätty tai esikäännetty segmentti editoitu, klikkaa {1>Translated<1}{2>-painiketta <2}{3>hyväksyäksesi käännöksesi ja siirtyäksesi seuraavaan segmenttiin<3}.

source: Alternatively, you can use the {4>keyboard shortcut<4}{5> Ctrl+Enter<5}.
fi: Vaihtoehtoisesti voit käyttää {4>näppäinyhdistelmää <4}{5> CTRL+Enter<5}.

source: {1>If you want to <1}{2>confirm the translation of the current segment and go to the next untranslated segment<2}, click on the {3>T+>> <3}{4>button or use the keyboard shortcut <4}{5>CTRL+SHIFT+Enter<5}.
fi: {1>Jos haluat <1}{2>hyväksyä nykyisen segmentin käännöksen ja siirtyä seuraavaan kääntämättömään segmenttiin<2}, klikkaa {3>T+>> <3}{4>-painiketta tai käytä näppäinyhdistelmää <4}{5>CTRL+SHIFT+Enter<5}.

source: The segment status bar colour will change from white to blue.
fi: Segmentin statuspalkin väri muuttuu valkoisesta siniseksi.

source: In this way you {1>save the segment and update the translation memory<1}.
fi: Näin voit {1>tallentaa segmentin ja päivittää käännösmuistin.<1}

source: If you do not click on the {2>Translated <2}button, and move manually on to the next (or press CTRL+Down) or to the previous (or press CTRL+Up) segment, your translation will be saved in the file but {3>the translation memory will not be updated<3}.
fi: Jos et klikkaa {2>Translated<2}-painiketta ja siirry manuaalisesti seuraavaan (painamalla CTRL + ALANUOLI) tai edelliseen (painamalla CTRL + YLÄNUOLI) segmenttiin, käännöksesi tallennetaan tiedostoon, mutta{3> käännösmuistia ei päivitetä<3}.

source: The bar to the right of each segment indicates its {1>status <1}using colours.
fi: Kunkin segmentin oikealla puolella oleva palkki ilmoittaa sen{1> statuksen<1} värejä käyttäen.

source: Click on it to display the following options and to set/change the {2>status of a segment<2}:
fi: Klikkaa sitä nähdäksesi seuraavat vaihtoehdot ja asettaaksesi tai muuttaaksesi{2> segmentin statusta<2}:

source: Autopropagation
fi: Automaattinen lisäys

source: When you approve a segment during translation, MateCat {1>automatically populates <1}{2>your translation with <2}{3>all segments having the same source <3}within the same project.
fi: Kun hyväksyt segmentin käännöksen aikana, MateCat {1>täyttää automaattisesti <1} {2>käännöksesi<2} {3>kaikkiin segmentteihin, jotka käyttävät samaa lähdettä<3} kyseisessä projektissa.

source: Page 42
fi: Sivu 42

source: They will be labelled as {1>AUTOPROPAGATED <1}as shown in the screenshot below
fi: Sellaiset segmentit merkitään {1>AUTOPROPAGATED (Automaattisesti lisätty),<1} kuten alla olevassa kuvakaappauksessa näkyy.

source: Your translation {1>will appear in all segments having the same source <1}but the status of the segments will remain “{2>untranslated<2}“.
fi: Käännöksesi {1>näkyy kaikissa segmenteissä joilla on sama lähde<1}, mutta segmenttien status on edelleen ”{2>untranslated<2}” (kääntämättä).

source: You must approve them manually by clicking on the {3>Translated <3}button (or use the CTRL+Enter shortcut).
fi: Sinun täytyy hyväksyä ne manuaalisesti klikkaamalla {3>Translated<3}-painiketta (tai pikanäppäinyhdistelmää CTRL + Enter).

source: Concordance Search
fi: Concordance Search (Vastaavuushaku)

source: Concordance searching allows you to search the translation memory, both public and private, if any, for a particular word, word sequence or phrase.
fi: Vastaavuus-haku mahdollistaa yksityiskohtaisten sanojen, sanaketjujen tai lausekkeiden haun niin julkisista kuin myös yksityisistä käännösmuisteista.
